using System.Runtime.Serialization;

namespace RiskManagement.Model
{
    [DataContract]
    public class Risk
    {
        [DataMember]
        public int Category { get; set; }
        [DataMember]
        public int RiskType { get; set; }
        [DataMember]
        public double[] Probabilities { get; set; }
        [DataMember]
        public double[] Losses { get; set; }
        [DataMember]
        public string Description { get; set; }
        private double _estimatedCost;
        [DataMember]
        public double EstimatedCost {
            get { return _estimatedCost; }
            set
            {
                if (value <= 0.0)
                    _estimatedCost = 0.0;
                else
                    _estimatedCost = value;
            }
        }
        [DataMember]
        public Solution Solution { get; set; }

        public bool HasSolution()
        {
            return Solution.SolutionID != null;
        }
        public double AverageProbability
        {
            get
            {
                double sum = 0.0;
                foreach (double probability in Probabilities)
                    sum += probability;
                if (HasSolution())
                    sum *= 0.8;
                return sum / 10;
            }
        }
        public double AverageLoss
        {
            get
            {
                double sum = 0.0;
                foreach (double loss in Losses)
                    sum += loss;
                return sum / 10;
            }
        }
        public static string[][] RiskNames { get; private set; }
        public static string[] CategoryNames { get; private set; }
        public static string[] FullCategoryNames { get; private set; }

        static Risk() {
            RiskNames = new string[4][];
            RiskNames[0] = new string[] {
                "Затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ",
                "Затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ",
                "Небажання команди виконавців використовувати інструментальні засоби для підтримки процесу розроблення ПЗ",
                "Формування запитів на більш потужні інструментальні засоби розроблення ПЗ",
                "Відмова команди виконавців від CASE-засобів розроблення ПЗ",
                "Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ",
                "Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ",
                "Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ",
                "Програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості",
                "Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів",
                "Поява дефектних системних компонент, які використовують для розроблення ПЗ"
            };
            RiskNames[1] = new string[] {
                "Недо(пере)оцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)",
                "Фінансові ускладнення у компанії-замовника ПЗ",
                "Змен(збіль)шення бюджету програмного проекта з ініціативи компанії-замовника ПЗ під час його реалізації",
                "Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ",
                "Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ",
                "Реорганізація структурних підрозділів у компанії-замовника ПЗ",
                "Реорганізація команди виконавців у компанії-розробника ПЗ"
            };
            RiskNames[2] = new string[] {
                "Зміни графіка виконання робіт з боку замовника чи розробника ПЗ",
                "Порушення графіка виконання робіт з боку компанії-розробника ПЗ",
                "Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ",
                "Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ",
                "Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ",
                "Недо(пере)оцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ",
                "Остаточний розмір ПЗ значно перевищує (менший від) заплановані(их) його характеристики",
                "Поява на ринку аналогічного ПЗ до виходу замовленого",
                "Поява на ринку більш конкурентоздатного ПЗ"
            };
            RiskNames[3] = new string[] {
                "Низький моральний стан персоналу команди виконавців ПЗ",
                "Низька взаємодія між членами команди виконавців ПЗ",
                "Пасивність керівника (менеджера) програмного проекту",
                "Недостатня компетентність керівника (менеджера) програмного проекту",
                "Незадоволеність замовника результатами етапів реалізації програмного проекту",
                "Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем",
                "Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ",
                "Одночасна хвороба декількох виконавців підчас розроблення ПЗ",
                "Неможливість організації необхідного навчання персоналу команди виконавців ПЗ",
                "Зміна пріоритетів у процесі управління програмним проектом",
                "Недо(пере)оцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
                "Недостатнє (надмірне) документування результатів на етапах реалізації програмного проекту",
                "Нереалістичне прогнозування результатів на етапах реалізації програмного проекту",
                "Недостатній професійний рівень представників від компанії-замовника ПЗ"
            };
            CategoryNames = new string[]
            {
                "Технічні ризикові події",
                "Вартісні ризикові події",
                "Планові ризикові події",
                "Ризикові події процесів управління програмним проектом"
            };
            FullCategoryNames = new string[]
            {
                "Множина настання технічних ризикових подій",
                "Множина настання вартісних ризикових подій",
                "Множина настання планових ризикових подій",
                "Множина ризикових подій реалізації процесу управління програмним проектом"
            };
        }

        public string RiskName
        {
            get { return RiskNames[Category][RiskType]; }
        }

        public string CategoryName
        {
            get { return CategoryNames[Category]; }
        }

        public string FullCategoryName
        {
            get { return FullCategoryNames[Category]; }
        }

        public static string getRiskName(int cat, int risk)
        {
            return RiskNames[cat][risk];
        }

        public static string getCategoryName(int cat)
        {
            return CategoryNames[cat];
        }
        public static string getFullCategoryName(int cat)
        {
            return FullCategoryNames[cat];
        }
    }
}
